# Отримуємо введення від користувача
число1 = int(input("Введіть перше число: "))
число2 = float(input("Введіть друге число: "))
операція = input("Введіть операцію (+, -, *, /): ")

# Перевірка на наявність операції
if операція not in ('+', '-', '*', '/'):
    print("Некоректна операція")
else:
    # Обчислення результату
    if операція == '+':
        результат = число1 + число2
    elif операція == '-':
        результат = число1 - число2
    elif операція == '*':
        результат = число1 * число2
    elif операція == '/':
        # Перевірка ділення на нуль
        if число2 == 0:
            результат = "Помилка: ділення на нуль"
        else:
            результат = число1 / число2

    # Виведення результату
    print("Результат:", результат)