# v1=45
# t1=78
#  v2=89
# t2=67

v1 = int(input("Введіть об'єм першої рідини (літри): "))
t1 = int(input("Введіть температуру першої рідини (градуси Цельсія): "))
v2 = int(input("Введіть об'єм другої рідини (літри): "))
t2 = int(input("Введіть температуру другої рідини (градуси Цельсія): "))

# Обчислюємо об'єм та температуру суміші за формулою
v_sum = v1 + v2
t_sum = (v1 * t1 + v2 * t2) / v_sum

# результат
print(f"Об'єм суміші: {v_sum} літрів")
print(f"Температура суміші: {t_sum} градусів Цельсія")
