# Функція для перевірки, чи є слово поліндромом
def is_palindrome(word):
    word = word.lower().replace(" ", "")
    return word == word[::-1]

# Введення слова від користувача
user_word = input("Введіть слово: ")

# Перевірка та виведення результату з поясненням
if is_palindrome(user_word):
    print(f"'{user_word}' є поліндромом (+) - це слово читається однаково зліва направо та справа наліво.")
else:
    print(f"'{user_word}' не є поліндромом (-) - це слово не читається однаково зліва направо та справа наліво.")

