class Вагон:
    def __init__(self, номер):
        self.номер = номер
        self.пасажири = []

    def додати_пасажира(self, пасажир):
        if len(self.пасажири) < 10:
            self.пасажири.append(пасажир)
        else:
            print("Вагон заповнений. Неможливо додати більше пасажирів.")

    def __len__(self):
        return len(self.пасажири)

    def __str__(self):
        return f"[{self.номер}]"


class Поїзд:
    def __init__(self):
        self.локомотив = Вагон("HEAD")
        self.вагони = []

    def додати_вагон(self, вагон):
        self.вагони.append(вагон)

    def __len__(self):
        return len(self.вагони)

    def __str__(self):
        вагони_рядок = "-".join(map(str, self.вагони))
        return f"<=[{self.локомотив}]-{вагони_рядок}"

# Приклад використання:

поїзд = Поїзд()
вагон1 = Вагон(1)
вагон2 = Вагон(2)
вагон3 = Вагон(3)

поїзд.додати_вагон(вагон1)
поїзд.додати_вагон(вагон2)
поїзд.додати_вагон(вагон3)

вагон1.додати_пасажира("Пасажир1")
вагон1.додати_пасажира("Пасажир2")

print(len(поїзд))  # Виведе кількість вагонів у поїзді
print(len(вагон1))  # Виведе кількість пасажирів у вагоні 1
print(поїзд)  # Виведе рядок, що представляє поїзд
