class CustomIterator:
    def __init__(self, послідовність, початковий_індекс, кінцевий_індекс):
        self.послідовність = послідовність
        self.початковий_індекс = початковий_індекс
        self.кінцевий_індекс = кінцевий_індекс

    def __iter__(self):
        return self

    def __next__(self):
        if self.початковий_індекс <= self.кінцевий_індекс:
            поточне_значення = self.послідовність[self.початковий_індекс]
            self.початковий_індекс += 1
            return поточне_значення
        else:
            raise StopIteration

# Приклад використання:
послідовність = [1, 2, 3, 4, 5]
ітератор = CustomIterator(послідовність, 1, 3)

for значення in ітератор:
    print(значення)
